#include "app_main.h"

//宏定义macro definition//

//类型定义byte definition//

//变量定义variable definition//

//标志未定义flags definetion//

//函数声明Function declaration//

//函数定义function definetion//
/*******************************************************************
函数原型：
输入参数：
输出参数：
函数功能：开启PWM
*******************************************************************/
void PWM_Open()//开启PWM
{
	T4CR |= 0x30;
	T4PCR2 |= 0x20;
}

/*******************************************************************
函数原型：
输入参数：
输出参数：
函数功能：关闭PWM
*******************************************************************/
void PWM_Shutdown()
{
	T4CR &= 0xCF;
	T4PCR2 &= 0x9F;
}


